import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.scss']
})
export class AppComponent {
  // *****************   این سورس برای آشنایی با قابلیت های اولیه ی انگولار هست    *****************
  // *****************   این که چطور میتونیم از صفحه ی لاجیک که تایپ اسکریپت هست   *****************
  // *****************   دیتاهارو به صفحه ی تمپلیت که اچ تی ام ال هست بایند کنیم  *****************
  // *****************       و به طور کلی این دو صفحه چطور به هم مرتبط میشن        ********************
  // *****************  همچنین به معرفی و ساخت دایرکتیوها و پایپ ها پرداخته ایم   ********************

  constructor() {}
}
